{
  "lastUpdated": "2026-01-05",
  "sections": [
    {
      "status": "in-progress",
      "title": "In Progress",
      "items": [
        {
          "title": "Chrome Extension UX Improvements",
          "description": "Based on user feedback: collapsible export panel, expanded full-screen error view, MVP mode toggle to pause linting, severity-based error filtering, and repositionable widget button."
        }
      ]
    },
    {
      "status": "shipped",
      "title": "Shipped Features",
      "items": [
        {
          "title": "R1-R14 Lint Rules",
          "description": "Complete set of 14 production-ready linting rules for n8n workflows, covering rate limiting, error handling, secrets detection, webhook acknowledgment, Retry-After compliance, and more."
        },
        {
          "title": "Interactive Visual Linter 2.0",
          "description": "Next generation of our web interface featuring: 1) URL-based Gist Sharing: share analysis results via private links, 2) Visual Graph: interactive n8n workflow visualization, 3) Real-time Analysis: instant feedback as you edit, 4) Professional Layout: 3-column desktop view with independent scrolling."
        },
        {
          "title": "GitHub App Integration",
          "description": "Full integration with GitHub Check Runs API for automated PR reviews with inline annotations."
        },
        {
          "title": "CLI Tool",
          "description": "Complete command-line interface with scan command, multiple output formats (stylish, JSON, SARIF, JUnit XML, GitHub Actions), config file support, and comprehensive CI/CD integration examples for GitHub Actions, GitLab CI, Jenkins, CircleCI, and Azure Pipelines."
        },
        {
          "title": "Chrome Extension with UX/UI 2.0",
          "description": "Real-time static analysis within the n8n editor featuring: 1) Expanded View mode with keyboard navigation (Escape to close, Ctrl+E toggle), 2) Rule Configuration for enabling/disabling specific rules, 3) First-run Onboarding Guide, 4) Export Results in multiple formats (Text, JSON, CSV, SARIF, JUnit), 5) Rules Warning indicator showing skipped rules."
        }
      ]
    },
    {
      "status": "in-progress",
      "title": "In Progress",
      "items": [
        {
          "title": "Suppression Mechanism",
          "description": "Allow developers to suppress specific findings with inline comments (flowlint-disable) similar to ESLint."
        }
      ]
    },
    {
      "status": "backlog",
      "title": "Future Ideas",
      "items": [
        {
          "title": "R15: Two-Phase Commit Pattern",
          "description": "Detect and recommend two-phase commit patterns for side effects (payments, emails) to prevent duplicate operations."
        },
        {
          "title": "R16: Schedule Concurrency Guards",
          "description": "Prevent concurrent execution of scheduled workflows when not intended, detecting overlapping cron jobs."
        },
        {
          "title": "Provider-Aware Retry Templates",
          "description": "Intelligent retry configuration suggestions based on API provider rate limits (Stripe, Shopify, Notion, GitHub)."
        },
        {
          "title": "Plugin System",
          "description": "Extensible architecture allowing teams to write and share custom lint rules via npm packages."
        }
      ]
    }
  ]
}
