{
  "lastUpdated": "2025-12-11",
  "sections": [
    {
      "status": "shipped",
      "title": "Shipped Features",
      "items": [
        {
          "title": "R1-R14 Lint Rules",
          "description": "Complete set of 14 production-ready linting rules for n8n workflows, covering rate limiting, error handling, secrets detection, webhook acknowledgment, Retry-After compliance, and more."
        },
        {
          "title": "GitHub App Integration",
          "description": "Full integration with GitHub Check Runs API for automated PR reviews with inline annotations."
        },
        {
          "title": "Observability Stack",
          "description": "Comprehensive monitoring with Prometheus, Grafana, and Tempo for distributed tracing."
        },
        {
          "title": "E2E Tests & Documentation",
          "description": "Complete end-to-end test suite, OpenAPI documentation, and distributed tracing implementation."
        },
        {
          "title": "CLI Tool",
          "description": "Complete command-line interface with scan command, multiple output formats (stylish, JSON, SARIF, JUnit XML, GitHub Actions), config file support, and comprehensive CI/CD integration examples for GitHub Actions, GitLab CI, Jenkins, CircleCI, and Azure Pipelines."
        }
      ]
    },
    {
      "status": "in-progress",
      "title": "In Progress",
      "quarter": "Q4 2025",
      "items": [
        {
          "title": "Web Interface (Online Linter)",
          "description": "Online linter interface allowing users to paste and analyze n8n workflows directly in the browser as an alternative to the Chrome extension."
        }
      ]
    },
    {
      "status": "planned",
      "title": "Coming Soon",
      "quarter": "Q1 2026",
      "items": [
        {
          "title": "Suppression Mechanism",
          "description": "Allow developers to suppress specific findings with inline comments (flowlint-disable) similar to ESLint."
        }
      ]
    },
    {
      "status": "backlog",
      "title": "Future Ideas",
      "items": [
        {
          "title": "R15: Two-Phase Commit Pattern",
          "description": "Detect and recommend two-phase commit patterns for side effects (payments, emails) to prevent duplicate operations."
        },
        {
          "title": "R16: Schedule Concurrency Guards",
          "description": "Prevent concurrent execution of scheduled workflows when not intended, detecting overlapping cron jobs."
        },
        {
          "title": "R17: Environment Drift Detection",
          "description": "Identify configuration differences between development, staging, and production workflows."
        },
        {
          "title": "Provider-Aware Retry Templates",
          "description": "Intelligent retry configuration suggestions based on API provider rate limits (Stripe, Shopify, Notion, GitHub)."
        },
        {
          "title": "Plugin System",
          "description": "Extensible architecture allowing teams to write and share custom lint rules via npm packages."
        }
      ]
    }
  ]
}